# Importar y exportar ficheros

Aunque otras librerías de Python proporcionan herramientas para importar y exportar datos, Pandas aporta una gran potencia a la hora de leer y/o escribir ficheros de datos. 
En esta sección abordamos el tema de cómo leer y almacenar datos en diferentes formatos, ya sea en ficheros o en bases de datos. Pandas proporciona una amplia colección de funciones para realizar la lectura de datos como un objeto de tipo `DataFrame`  de una forma sencilla y flexible.

In [4]:
import pandas as pd
import numpy as np

## Ficheros de texto o CSV

En muchas ocasiones los datos en encuentran almacenados en ficheros de texto y representados en forma de tabla. El formato más popular es el CSV , donde los valores de cada una de las filas están separados por el símbolo coma (`,`).  En otras ocasiones, los valores de cada fila están separados por otro símbolo, un tabulador o  un espacio. Este tipo de ficheros normalmente tienen extensión `.txt`. 

Las funciones más utilizadas en pandas para leer de forma flexible ficheros de texto plano son  `pd.read_csv` y  `pd.read_table`. La escritura de los datos contenidos en un dataframe o una serie se realiza mediante el método `to_csv` de las clases `Series` y `DataFrame`.

### Lectura de ficheros de texto o CSV

El fichero [animals1.csv](./datos/animals1.csv) contiene información del peso medio del cuerpo y cerebro de 8 especies de animales:

```
animals1.csv
------------
Especie,Peso cuerpo,Peso cerebro
Big brown bat,0.023,0.3
Mouse,0.023,0.4
Ground squirrel,0.101,4
Tree shrew,0.104,2.5
Golden hamster,0.12,1
Mole,0.122,3
Galago,0.2,5
Rat,0.28,1.9
```

La función `pd.read_csv` permite crear un objeto de tipo `DataFrame` a partir de los datos contenidos en un fichero en formato CSV.

In [5]:
dfcsv = pd.read_csv('datos/animals1.csv')
dfcsv

           Especie  Peso cuerpo  Peso cerebro
0    Big brown bat        0.023           0.3
1            Mouse        0.023           0.4
2  Ground squirrel        0.101           4.0
3       Tree shrew        0.104           2.5
4   Golden hamster        0.120           1.0
5             Mole        0.122           3.0
6           Galago        0.200           5.0
7              Rat        0.280           1.9

Como podemos ver, la creación de dataframes a partir de un fichero CSV es bastante sencilla. En realidad, los ficheros CSV son ficheros de texto, por lo que también podremos utilizar la función `pd.read_table` para crear dataframes indicando el separador de los  valores de cada una de las filas en el argumento `delimiter`:

In [6]:
dfcsv = pd.read_table('datos/animals1.csv', delimiter = ',')
dfcsv

/Users/mariacarrasco/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

           Especie  Peso cuerpo  Peso cerebro
0    Big brown bat        0.023           0.3
1            Mouse        0.023           0.4
2  Ground squirrel        0.101           4.0
3       Tree shrew        0.104           2.5
4   Golden hamster        0.120           1.0
5             Mole        0.122           3.0
6           Galago        0.200           5.0
7              Rat        0.280           1.9

Cuando los datos almacenados en el fichero no contienen la información acerca del nombre de cada una de las columnas, es decir, los datos aparecen en la primera fila del fichero, podemos indicar mediante el argumento `header` la ausencia de cabeceras. 

```
animals2.csv
------------
Big brown bat,0.023,0.3
Mouse,0.023,0.4
Ground squirrel,0.101,4
Tree shrew,0.104,2.5
Golden hamster,0.12,1
Mole,0.122,3
Galago,0.2,5
Rat,0.28,1.9
```

Las columnas del dataframe se indexan de forma automática con valores de tipo `int` comenzando por el valor `0`.

In [7]:
dfcsv = pd.read_csv('datos/Animals2.csv', header = None)
dfcsv

                 0      1    2
0    Big brown bat  0.023  0.3
1            Mouse  0.023  0.4
2  Ground squirrel  0.101  4.0
3       Tree shrew  0.104  2.5
4   Golden hamster  0.120  1.0
5             Mole  0.122  3.0
6           Galago  0.200  5.0
7              Rat  0.280  1.9

Usando el argumento `names` de la función `pd.read_csv` es posible asignar un nombre más significativo a cada una de las columnas:

In [8]:
pd.read_csv?

In [9]:
dfcsv = pd.read_csv('datos/animals2.csv', 
                    header = None, 
                    names = ['Especie', 'Peso Cuerpo', 'Peso cerebro'])
dfcsv

           Especie  Peso Cuerpo  Peso cerebro
0    Big brown bat        0.023           0.3
1            Mouse        0.023           0.4
2  Ground squirrel        0.101           4.0
3       Tree shrew        0.104           2.5
4   Golden hamster        0.120           1.0
5             Mole        0.122           3.0
6           Galago        0.200           5.0
7              Rat        0.280           1.9

En algunas ocasiones las primeras líneas del fichero no se corresponden con datos propiamente dichos, si no que símplemente aportan una descripción de los datos que contiene.

```
peliculas.csv
------------
Cine de los 90
*********************************
Extreno: Fecha de extreno
Nombre: Título de la película
Cat: Género de la película
*********************************
Extreno,Nombre,Cat
1982,E.T. the ExtraTerrestrial,Fantasy
1982,Poltergeist,Horror
1992,Alien,Action
1992,The Crying Game,War
1995,Toy Story,Animation
1995,GoldenEye,Action
1995,Four Rooms,Thriller
```

El argumento `skiprows` permite omitir la lectura de un número determinado de filas al comienzo del fichero.

In [10]:
dfcsv = pd.read_csv('datos/peliculas.csv', skiprows = 6)
dfcsv

   Extreno                     Nombre        Cat
0     1982  E.T. the ExtraTerrestrial    Fantasy
1     1982                Poltergeist     Horror
2     1992                      Alien     Action
3     1992            The Crying Game        War
4     1995                  Toy Story  Animation
5     1995                  GoldenEye     Action
6     1995                 Four Rooms   Thriller

Para crear objetos de tipo  `DataFrame` donde los valores de una de las columnas en el fichero se van a convertir en el índice del dataframe, usamos el argumento `index_col`:

In [11]:
dfcsv = pd.read_csv('datos/peliculas.csv', 
                    skiprows = 6, 
                    index_col = ['Extreno'])
dfcsv

                            Nombre        Cat
Extreno
1982     E.T. the ExtraTerrestrial    Fantasy
1982                   Poltergeist     Horror
1992                         Alien     Action
1992               The Crying Game        War
1995                     Toy Story  Animation
1995                     GoldenEye     Action
1995                    Four Rooms   Thriller

In [12]:
dfcsv.loc[1995]

             Nombre        Cat
Extreno
1995      Toy Story  Animation
1995      GoldenEye     Action
1995     Four Rooms   Thriller

También es posible crear dataframes con multiíndices a partir de los datos contenidos en un fichero. Por ejemplo, podemos usar el argumento `index_col` con la lista de columnas en el  fichero serán los índices del dataframe:

In [13]:
dfcsv = pd.read_csv('datos/peliculas.csv', 
                    skiprows = 6, 
                    index_col = [0, 1])
dfcsv

                                         Cat
Extreno Nombre
1982    E.T. the ExtraTerrestrial    Fantasy
        Poltergeist                   Horror
1992    Alien                         Action
        The Crying Game                  War
1995    Toy Story                  Animation
        GoldenEye                     Action
        Four Rooms                  Thriller


Cuando los ficheros de datos que queremos procesar son muy grandes, pandas ofrece la posibilidad de realizar una lectura por partes. Esta opción permite procesar solo una parte de los datos. El argumento `nrows` permite procesar un numero determinado de filas del fichero, mientras que el argumento `skiprows` permite indicar las filas que no queremos procesar.

In [14]:
dfcsv = pd.read_csv('datos/peliculas.csv', skiprows = 6, nrows =2)
dfcsv

   Extreno                     Nombre      Cat
0     1982  E.T. the ExtraTerrestrial  Fantasy
1     1982                Poltergeist   Horror

Si queremos leer el fichero completo en trozos, usamos el argumento `chunksize` para especificar el número de filas que componen cada trozo.

```

peliculas2.csv
------------
Extreno,Nombre,Minutos
1982,E.T. the ExtraTerrestrial,114
1982,Poltergeist,91
1992,Alien,144
1992,The Crying Game,113
1995,Toy Story,81
1995,GoldenEye,130
1995,Four Rooms,94
```

En el siguiente ejemplo, leemos el fichero por trozos y procesamos cada uno de ellos.

In [15]:
trozos = pd.read_csv('./datos/peliculas2.csv', chunksize = 3) 

for t in trozos:                        
    print(len(t), t.Minutos.max())

3 144
3 130
1 94

En el ejemplo anterior, se realiza una lectura del fichero en porciones de tres filas, excepto la última porción que consta solo de una fila. El iterador `for` permite iterar sobre cada uno de los trozos y procesarlos.

### Escritura de datos en ficheros CSV

Los datos almacenados en las estructuras de datos de Pandas, ya sea en `Series` o `DataFrames`, pueden ser almacenados en ficheros. Esta es una operación se realiza de forma habitual después del procesamiento de datos, limpieza, etc.
Por ejemplo, para escribir los datos incluídos en un DataFrame en un fichero CSV utilizamos el método [`to_csv`](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_csv.html) con el nombre del fichero como argumento.

In [16]:
dfcsv = pd.read_csv('datos/peliculas2.csv', index_col = ['Extreno'])
dfcsv

                            Nombre  Minutos
Extreno
1982     E.T. the ExtraTerrestrial      114
1982                   Poltergeist       91
1992                         Alien      144
1992               The Crying Game      113
1995                     Toy Story       81
1995                     GoldenEye      130
1995                    Four Rooms       94

Admite una gran cantidad de parámetros. Opcionalmente podemos generar un fichero csv con cabeceras o sin ellas, con índices o sin ellos.

In [17]:
dfcsv.to_csv('./datos/datos.csv')

```
datos.csv
------------
Extreno,Nombre,Minutos
1982,E.T. the ExtraTerrestrial,114
1982,Poltergeist,91
1992,Alien,144
1992,The Crying Game,113
1995,Toy Story,81
1995,GoldenEye,130
1995,Four Rooms,94

```

Como se puede ver en el ejemplo, tanto el índice como las columnas del DataFrame se escriben en el fichero. Los argumentos `index` y `header` permiten cambiar el comportamiento por defecto:

In [18]:
dfcsv.to_csv('./datos/datos.csv', header = True, index = False)

```

datos.csv
------------
Nombre,Minutos
E.T. the ExtraTerrestrial,114
Poltergeist,91
Alien,144
The Crying Game,113
Toy Story,81
GoldenEye,130
Four Rooms,94
```

## Ficheros en formato Microsoft Excel

Otra forma muy habitual para guardar datos en forma tabular es mediante hojas de cálculo en un libro o fichero de Microsoft Excel. Pandas incluye la función `pd.read_excel` para realizar la lectura de datos y crear dataframes, mientras que el método `to_excel` de la clase `Dataframe` permite escribir los datos en una hoja de cálculo de Microsoft Excel.

### Lectura de ficheros Excel

La función [`pd.read_excel`](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_excel.html) permite crear objetos de tipo `DataFrame` a partir de los datos contenidos en ficheros con extensión `.xls` y `.xlsx`. La figura XX muestra el contenido de dos hojas contenidas en el fichero [clientes.xlsx](./datos/clientes.xlsx).

<img src="./images/imagenExcel.jpg">

Por defecto, la función `pd.read_excel` lee los datos de la primera hoja dentro del libro, pero se puede indicar que lea los datos de otra hoja usando el argumento `sheetname`.

In [19]:
dfexcel = pd.read_excel('./datos/clientes.xlsx') 
dfexcel

     CODCLI        NOMCLI SEXO
0  CLI-0001   ROSA ELVIRA    F
1  CLI-0003  MIGUEL ANGEL    M
2  CLI-0004     ANA MARIA    F
3  CLI-0013    BRIGGITTE     F
4  CLI-0018   SAULO ANDRE    M
5  CLI-0020        MONICA    F

In [20]:
dfexcel = pd.read_excel('./datos/clientes.xlsx', sheet_name = "Hoja2") 
dfexcel

     CODCLI  EUROS     MAX
0  CLI-0001  89574  100000
1  CLI-0019  68752   80000
2  CLI-0020  63014   70000

La función `pd.read_excel` es tan flexible como lo pueda ser la función `pd.read_csv` para ficheros de texto. Es posible saltar cabeceras, leer un número determinado de filas, leer solo algunas de las columnas contenidas en la hoja de cálculo, etc. Su funcionamiento varía dependiendo de los valores de los argumentos cuando se invoca la función. 

En el siguiente ejemplo aplicamos una función de conversión (función `funtitle` previamente definida) a los valores contenidos en la columna `NOMCLI` de la primera hoja del fichero.

In [21]:
def funtitle(cadena):
    return cadena.title()



def transforma_sexo(valor):
    if valor == 'F':
        return 'Mujer'
    elif valor =='M':
        return 'Hombre'
    else:
        return valor

dfexcel = pd.read_excel('./datos/clientes.xlsx', 
                        converters = {'NOMCLI': funtitle}) 
dfexcel

     CODCLI        NOMCLI SEXO
0  CLI-0001   Rosa Elvira    F
1  CLI-0003  Miguel Angel    M
2  CLI-0004     Ana Maria    F
3  CLI-0013    Briggitte     F
4  CLI-0018   Saulo Andre    M
5  CLI-0020        Monica    F

O lo que es lo mismo, pero usando funciones anónimas:

In [22]:
dfexcel = pd.read_excel('./datos/clientes.xlsx', 
                      converters = {'NOMCLI': lambda x: x.title() }) 
dfexcel

     CODCLI        NOMCLI SEXO
0  CLI-0001   Rosa Elvira    F
1  CLI-0003  Miguel Angel    M
2  CLI-0004     Ana Maria    F
3  CLI-0013    Briggitte     F
4  CLI-0018   Saulo Andre    M
5  CLI-0020        Monica    F

El argumento `converters` recibe como valor un diccionario, cuyas claves son las columnas sobre las que se va a aplicar una función de conversión. El valor asociado a cada clave es la función a aplicar.

El argumento `na_values` permite sustituir valores contenidos en la hoja de cálculo por `NaN`.  Dicho argumento recibe un diccionario, cuyas claves son las columnas sobre las que se va a aplicar la sustitución, y el valor de cada clave es la lista de valores que han de ser sustituidos por NaN. 

<img src="./images/imagenExcel2.jpg">

La columna `TLF` tiene valor `-` en aquellas celdas donde no se conoce el dato, mientras  que la columna `SEXO` tiene celdas con valor `Desconocido`. También podemos observar que la columna `NOMCLI` tiene una celda vacía. En el siguiente ejemplo mostramos cómo manejar estas situaciones:

In [20]:
dfexcel = pd.read_excel('./datos/clientes1.xlsx', 
                      na_values = {'SEXO': ['Desconocido'],
                                   'TLF' : ['-'] } ) 
dfexcel

     CODCLI        NOMCLI SEXO     TLF
0  CLI-0001   ROSA ELVIRA    F  7578.0
1  CLI-0003  MIGUEL ANGEL  NaN     NaN
2  CLI-0004     ANA MARIA  NaN     NaN
3  CLI-0013    BRIGGITTE     F     NaN
4  CLI-0018   SAULO ANDRE    M     NaN
5  CLI-0020           NaN    F  7600.0

Las celdas vacías en la hoja de cálculo se transforman automáticamente en `NaN` en el dataframe.

### Escritura en ficheros Excel

Pandas también ofrece la posibilidad de escribir los datos incluídos en un DataFrame en
una hoja de un fichero Excel. Para ello usamos el método `to_excel` de la clase `DataFrame` indicando el nombre del fichero. Los argumentos `header` e `index` , discutidos en el caso del método `to_csv`, también están disponibles aquí.

In [27]:
dfexcel.to_excel('clientes4.xlsx', index = False)

Se puede observar que los valores `NAN` del dataframe pasan a ser celdas vacías en la hoja de cálculo, pudiéndose usar el argumento `na_rep` para cambiar el comportamiento.

<img src="./images/imagenExcel3.jpg">

En el siguiente ejemplo usamos el argumento `sheet_name` para asignar un nombre a la hoja de cálculo creada entro del fichero y el argumento `columns` para indicar el subconjunto de columnas que queremos llevar a la hoja de cálculo.

In [28]:
dfexcel.to_excel('clientes5.xlsx', index = False, 
                   sheet_name='mis datos', 
                   columns = ['NOMCLI', 'SEXO'],
                   na_rep='--')

<img src="./images/imagenExcel4.jpg">

## Referencias

* Otras librerías para tratamiento de documentos Excel: openpyxl, xlrd, xlutils y pyexcel.

* [Big Data. Análisis de datos con Python. Sarasa Cabezuelo, Antonio; García Ruiz, Yolanda Aditorial Garceta. ISBN: 978-84-1622-883-6](http://www.garceta.es/libro.php?ISBN=978-84-1622-883-6)

* [Python for Data Analysis](http://shop.oreilly.com/product/0636920023784.do)

------

------------